const read = {
    ulem: ['q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', 'ü', 'õ'],
    kesk: ['a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'ö', 'ä'],
    alum: ['z', 'x', 'c', 'v', 'b', 'n', 'm']
  };

const sormed =  {
    v1: ["a", "z", "<", "q"], //vasak väike (roosake)
    v2: ["w", "s", "x"],
    v3: ["e", "d", "c"],
    v4: ["r", "t", "f", "g", "v", "b"],

    p1: ["p", "ü", "õ", "ö", "ä", "'", "-"],
    p2: ["o", "l", "."],
    p3: [",", "k", "i"],
    p4: ["m", "n", "j", "h", "u", "y"],
}